vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G032_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G032_DFP</name>
    <description>Nsing N32G032 Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="0.2.2">		    
            First release of N32G032_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G032</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G032 Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <description>
The N32G032 series utilizes a 32-bit ARM Cortex-M0 core with operating frequency up to 48MHz. 

- Up to 64KB embedded encrypted Flash memory.
- 16KB SRAM.
- 1x 12bit 1Msps ADC and 1x high-speed comparators
- 4x USART, 2x LPUART, 2x I2C, 3x SPI, 1x OPAMP, 1x OPA and 2x Beeper	
- 1x CAN, TSC
- Hardware Cryptographics Engine.
          </description>
  
          <subFamily DsubFamily="N32G032">
		   <processor Dclock="48000000"/>		   
           <compile header="firmware/CMSIS/device/n32g032.h" define="N32G032 USE_STDPERIPH_DRIVER"/>
	  	   <feature type="XTAL"     n="4000000"     m="48000000" name="Internal RC Oscillator"/>		   
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32G032F6U7'  ***************************** -->
		  <device Dname="N32G032F6U7"> 
			<description>
- Package:UFQFPN20
- LPUART: 1x	
- OPA: 1x			
			</description>		
			
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="11"/>				
			<feature type="ADC"      n="7"     	m="12"  name="7-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G032F6S7'  ***************************** -->
		  <device Dname="N32G032F6S7"> 
		  	<description>
- Package:TSSOP20
- LPUART: 2x	
- OPA: 1x	
- TSC: 1x		
			</description>	
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="PWM"      n="11"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G032P6W7'  ***************************** -->
		  <device Dname="N32G032P6W7"> 
		  	<description>
- Package:WLCSP25
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>		  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="5"/>
			<feature type="PWM"      n="16"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G032P8W7'  ***************************** -->
		  <device Dname="N32G032P8W7"> 
		  	<description>
- Package:WLCSP25
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="21"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="16"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>				
		    <feature type="SPI"      n="1"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G032K6Q7'  ***************************** -->
		  <device Dname="N32G032K6Q7"> 
		  	<description>
- Package:QFN32
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="19"/>				
			<feature type="ADC"      n="12"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G032K6L7'  ***************************** -->
		  <device Dname="N32G032K6L7"> 
		  	<description>
- Package:LQFP32
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="25"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="19"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G032K8L7'  ***************************** -->
		  <device Dname="N32G032K8L7"> 
		  	<description>
- Package:LQFP32
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="25"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="19"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G032C8L7'  ***************************** -->
		  <device Dname="N32G032C8L7"> 
		  	<description>
- Package:LQFP48
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 		name="16KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="26"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G032R8L7'  ***************************** -->
		  <device Dname="N32G032R8L7"> 
		  	<description>
- Package:LQFP64
- LPUART: 2x	
- OPA: 1x
- TSC: 1x			
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 		name="16KB SRAM"/>	
			<feature type="IOs"      n="56"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="30"/>			
			<feature type="ADC"      n="16"      m="12"  name="16-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="2"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G032x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G032.svd"/>
          </device>
		  
        </subFamily>
        </family>
    </devices> 

    <conditions>   
		<!-- Compiler Conditions -->
        <!-- condition id="Compiler ARMCC">             
            <require Tcompiler="ARMCC"/>
        </condition -->
		
		<!-- Device Conditions -->
		<condition id="N32G032">
		  <description>NSING N32G032 Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G032 CMSIS">            
		    <description>NSING N32G032 Device and the ARM compiler</description>
		    <require condition="N32G032"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

