vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G032_DFP.pdsc
		<!-- N32G032 STDPERIPHERALS MISC Conditions -->
        <condition id="N32G032 STDPERIPHERALS">
            <description>NSING N32G032 Standard Peripherals drivers</description>
            <require condition="N32G032 CMSIS"/>
            <require Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="MISC"/>
        </condition>
		
		<!-- N32G032 STDPERIPHERALS RCC Conditions -->
        <condition id="N32G032 STDPERIPHERALS RCC">
            <description>NSING N32G032 Standard Peripherals driver with RCC</description>
            <require condition="N32G032 STDPERIPHERALS"/>
            <require Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="RCC"/>
        </condition>
		
		<condition id="N32G032 Algorithm Common" >
            <description>NSING N32G032 Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G032 CMSIS"/>
            <require Cclass ="Device" Cgroup="Algorithm_Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G032 CMSIS">
            <description>Startup File for Nsing N32G032 Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32g032.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g032.s" attr="config"  version="1.0.0" condition="N32G032 CMSIS"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32g032.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32G032_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32G032 CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g032_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_adc.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_adc.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="BEEPER" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>BEEPER driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BEEPER
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_beeper.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_beeper.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Controller area network (CAN) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_can.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_can.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_comp.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_comp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_crc.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_crc.c"/>
            </files>
        </component>
		
       <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_dbg.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_dbg.c"/>
            </files>
        </component>
 
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_dma.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_dma.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_exti.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_exti.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_flash.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_flash.c"/>
            </files>
        </component>

