vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G032_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_gpio.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_gpio.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="HDIV" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>High-speed divider (HDIV) interface driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_HDIV
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_hdiv.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_hdiv.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_i2c.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_iwdg.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_lptim.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_lptim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="LPUART" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Low Power Universal asynchronous receiver transmitter (LPUART) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPUART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_lpuart.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_lpuart.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_opamp.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_opamp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_pwr.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="RCC" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Reset and clock control (RCC) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_rcc.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_rcc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Real-time clock (RTC) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_rtc.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_rtc.c"/>
            </files>
        </component>
		
