vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G032_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="SPI" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Serial peripheral interface (SPI) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_spi.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_spi.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="SQRT" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Square Root Calculations (SQRT) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SQRT
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_sqrt.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_sqrt.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Timers (TIMER) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_tim.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_tim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="TSC" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Touch Sensing Controller (TSC) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TSC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_tsc.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_tsc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Universal asynchronous receiver transmitter (USART) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_usart.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_usart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G032_StdPeripherals" Csub="WWDG" Cversion="1.0.0" condition="N32G032 STDPERIPHERALS RCC">
            <description>Window watchdog (WWDG) driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_std_periph_driver/inc/n32g032_wwdg.h"/>
                <file category="source" name="firmware/n32g032_std_periph_driver/src/n32g032_wwdg.c"/>
            </files>
        </component>		

		<component Cclass="Device" Cgroup="Algorithm_Libs" Csub="Common" Cversion="1.0.0" condition="N32G032 CMSIS">
		    <description>Algo driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <!--file category="include" name="firmware/n32a455_algo_lib/inc"/ -->
                <file category="header" name="firmware/n32g032_algo_lib/inc/n32g032_algo_common.h"/>
                <file category="source" name="firmware/n32g032_algo_lib/lib/n32g032_algo_common.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="AES" Cversion="1.0.0" condition="N32G032 Algorithm Common">
		    <description>AES driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_algo_lib/inc/n32g032_aes.h"/>
                <file category="source" name="firmware/n32g032_algo_lib/lib/n32g032_aes.lib"/>
            </files>
        </component>
        
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="RNG" Cversion="1.0.0" condition="N32G032 Algorithm Common">
		    <description>RNG driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_algo_lib/inc/n32g032_rng.h"/>
                <file category="source" name="firmware/n32g032_algo_lib/lib/n32g032_rng.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="SM4" Cversion="1.0.0" condition="N32G032 Algorithm Common">
		    <description>SM4 driver for N32G032</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_SM4
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g032_algo_lib/inc/n32g032_sm4.h"/>
                <file category="source" name="firmware/n32g032_algo_lib/lib/n32g032_sm4.lib"/>
            </files>
        </component>	
		
    </components>
</package>
